fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <registerRecords>AccumulationRegister.ВКМ_ДанныеПоОтпускамСотрудников</registerRecords>
  <attributes>
    <name>Год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ВКМ_Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоДнейОтпуска</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийЭлементовТаблицыФормыОтпускаСотрудников

&НаКлиенте
Процедура ОтпускаСотрудниковПриИзменении(Элемент)
	ОтпускаСотрудниковПриИзмененииНаСервере();
КонецПроцедуры  

&НаСервере
Процедура ОтпускаСотрудниковПриИзмененииНаСервере()
	
	Для Каждого Сотрудник Из Объект.ОтпускаСотрудников Цикл
		
		Сотрудник.КоличествоДнейОтпуска = Окр((КонецДня(Сотрудник.ДатаОкончания) - НачалоДня(Сотрудник.ДатаНачала))/(60*60*24),0, РежимОкругления.Окр15как20);
				
    КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ДиаграммаОтпусков(Команда) 
	
	ДанныеВоВременномХранилище = ДанныеВоВременномХранилище(); 
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ДанныеВоВременномХранилище", ДанныеВоВременномХранилище);
		
	ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.АнализГрафика", ПараметрыФормы);
	
КонецПроцедуры 

&НаСервере
Функция ДанныеВоВременномХранилище() Экспорт  	
	
    ОтпускаСотрудниковМассив = Новый Массив;
    	
	Для Каждого Строка Из Объект.ОтпускаСотрудников Цикл 
		
		ОтпускаСотрудниковСтруктура = Новый Структура;

		Сотрудник = Строка.Сотрудник; 
		ДатаНачала = Строка.ДатаНачала; 
		ДатаОкончания = Строка.ДатаОкончания;
		
	    ОтпускаСотрудниковСтруктура.Вставить("Сотрудник", Сотрудник);
		ОтпускаСотрудниковСтруктура.Вставить("ДатаНачала", ДатаНачала);
		ОтпускаСотрудниковСтруктура.Вставить("ДатаОкончания", ДатаОкончания);
		
		ОтпускаСотрудниковМассив.Добавить(ОтпускаСотрудниковСтруктура);    
		
	КонецЦикла; 
	
    АдресВоВремХранилище = ПоместитьВоВременноеХранилище(ОтпускаСотрудниковМассив, Новый УникальныйИдентификатор); 
	
	Возврат АдресВоВремХранилище;
	
КонецФункции 

#КонецОбласти
